tutorials/compressible/steadyUniversalMRFFoam/axialTurbineMixingPlane/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    GVINLET
    {
        type            fixedValue;
        value           uniform 0.375;
    }
    GVOUTLET
    {
        type            mixingPlane;
        value           uniform 0.375;
    }
    GVCYCLIC
    {
        type            cyclic;
        value           uniform 0.375;
    }
    GVBLADE
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.375;
    }
    GVHUB
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.375;
    }
    GVSHROUD
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.375;
    }
    RUINLET
    {
        type            mixingPlane;
        value           uniform 0.375;
    }
    RUOUTLET
    {
        type            mixingPlane;
        value           uniform 0.375;
    }
    RUCYCLIC1
    {
        type            cyclicGgi;
        value           uniform 0.375;
    }
    RUCYCLIC2
    {
        type            cyclicGgi;
        value           uniform 0.375;
    }
    RUBLADE
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.375;
    }
    RUHUB
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.375;
    }
    RUSHROUD
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.375;
    }
    DTINLET
    {
        type            mixingPlane;
        value           uniform 0.375;
    }
    DTOUTLET
    {
        type            zeroGradient;
    }
    DTCYCLIC1
    {
        type            cyclicGgi;
        value           uniform 0.375;
    }
    DTCYCLIC2
    {
        type            cyclicGgi;
        value           uniform 0.375;
    }
    DTHUB
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.375;
    }
    DTSHROUD
    {
        type            compressible::kqRWallFunction;
        value           uniform 0.375;
    }
}


// ************************************************************************* //
